// Copyright (c) 2011 The Chromium OS Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

/* Error starting Disk Arbitration. */
"NoDiskArb Message" = "Não é possível executar esta aplicação.";
"NoDiskArb Informative" = "Ocorreu um problema ao iniciar a Arbitragem do Disco. Isto não deverá acontecer.";
"NoDiskArb OK" = "OK";

/* Error retrieving config file. */
"CantGetConfig Message" = "Não é possível obter a lista de imagens.";
"CantGetConfig Informative" = "Ocorreu um problema ao obter a lista de imagens de recuperação disponíveis (%1$@). Certifique-se de que a ligação à rede está a funcionar.";
"CantGetConfig OK" = "OK";
"CantGetConfig Error NoConnection" = "não foi possível atribuir uma ligação";
"CantGetConfig Error DownloadError" = "ocorreu um erro durante a transferência";
"CantGetConfig Error StringCreate" = "não foi possível utilizar a resposta";

/* Version error. */
"VersionError Message" = "Esta versão da aplicação é demasiado antiga.";
"VersionError Informative" = "Transfira uma versão mais recente. Esta versão é a %1$@; é necessário, pelo menos, a versão %2$@. %3$@";
"VersionError OK" = "Obter Nova Versão";

/* File dialog to select a local file. */
"SelectLocal File" = "Selecione uma imagem:";
"SelectLocal Button" = "Selecionar";

/* Alert on writing stick. */
"WriteAlert Message" = "Tem a certeza de que pretende apagar permanentemente %1$@?";
"WriteAlert Informative" = "Todos os dados existentes serão perdidos permanentemente. Não é possível anular esta ação.";
"WriteAlert Cancel" = "Não Apagar";
"WriteAlert OK" = "Apagar";

"TooSmallAlert Message" = "Não é possível utilizar %1$@; é demasiado pequeno.";
"TooSmallAlert Informative" = "É necessário um Stick USB de, pelo menos, %2$@.";
"TooSmallAlert OK" = "OK";

"NotWritable Message" = "Não é possível utilizar %1$@; é só de leitura.";
"NotWritable Informative" = "O Stick USB é só de leitura. Poderá existir um botão no Stick USb que permita escrever no mesmo; caso contrário, não é possível utilizá-lo.";
"NotWritable OK" = "OK";

/* Stick writing statuses. */
"Status Downloading" = "A transferir…";
"Status Verifying" = "A verificar…";
"Status Unpacking" = "A descompactar…";
"Status Claiming" = "A reivindicar…";
"Status Unmounting" = "A desmontar…";
"Status Writing" = "A escrever…";
"Status Ejecting" = "A ejetar…";
"Status Done" = "Concluído!";

"StatusAdd Attempt" = " (tentativa %1$d)";

/* Errors */
"Failure Downloading" = "Ocorreu um erro (falha ao transferir a imagem de origem). Pretende tentar novamente?";
"Failure Verifying Return Value" = "Ocorreu um erro (falha ao verificar a imagem de origem, falha do programa, %1$s). Pretende tentar novamente?";
"Failure Verifying SHA Mismatch" = "Ocorreu um erro (falha ao verificar a imagem de origem, falha de soma de verificação). Pretende tentar novamente?";
"Failure Unpacking" = "Ocorreu um erro (falha ao descompactar a imagem de origem, %1$s). Pretende tentar novamente?";
"Failure Claiming" = "Ocorreu um erro (falha ao reivindicar o stick USB). Pretende tentar novamente?";
"Failure Unmounting" = "Ocorreu um erro (falha ao desmontar o stick USB). Pretende tentar novamente?";
"Failure Opening Source Image" = "Ocorreu um erro (falha ao abrir a imagem de origem, %1$s). Pretende tentar novamente?";
"Failure Opening Destination Device" = "Ocorreu um erro (falha ao abrir o stick USB), %1$s). Pretende tentar novamente?";
"Failure Reading Source Image" = "Ocorreu um erro (falha ao ler a partir da imagem de origem, %1$s). Pretende tentar novamente?";
"Failure Writing Destination Device" = "Ocorreu um erro (falha ao escrever os dados no stick USB, %1$s). Pretende tentar novamente?";
"Failure Ejecting" = "Ocorreu um erro (falha ao ejetar o stick USB). Pretende tentar novamente?";

"Failure Try Again" = "Tentar Novamente";
"Failure Quit" = "Sair";

"Failure Termination Status" = "Estado de Encerramento%d";

"Failure Internal Error 1" = "EOF Inesperado";
